app/views/books/_json_search.xml.erb

<soapenv:Envelope
xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
xmlns:opac="http://opac.provider.elis.unipotsdam.de/">
  <soapenv:Header/>
  <soapenv:Body>
     <opac:search>
        <keyword><%= search %></keyword>
        <page><%= page %></page>
     </opac:search>
  </soapenv:Body>
</soapenv:Envelope>